In [1]:
import pandas as pd
from bs4 import BeautifulSoup 
import requests
import datetime
from datetime import date 
import time
import json
import csv
import numpy as np
import re
import lxml.html
import os
import tabula

In [2]:
wta_path = "https://wtafiles.wtatennis.com/pdf/rankings/All_YTD_Prize_Money.pdf"

In [3]:
atp_path = "https://www.protennislive.com/posting/ramr/current_prize.pdf"

In [4]:
wta_dfs = tabula.read_pdf(wta_path, stream=False, user_agent="Mozilla/5.0", pages='1-11')
# read_pdf returns list of DataFrames
print(len(wta_dfs))

11

In [5]:
print(wta_dfs[2])

    Standing                 Unnamed: 0  Name  Nat  Singles  Doubles    Mixed  \
0         93               BUREL, CLARA   NaN  FRA  479,101   20,370    5,000
1         94              MINNEN, GREET   NaN  BEL  390,947  107,891      NaN
2         95              NAVARRO, EMMA   NaN  USA  463,806   34,283      NaN
3         96       PARRIZAS DIAZ, NURIA   NaN  ESP  486,764    9,125      NaN
4         97            VOLYNETS, KATIE   NaN  USA  492,258      697      NaN
5         98               GALFI, DALMA   NaN  HUN  459,858   26,841      NaN
6         99           KALINSKAYA, ANNA   NaN  NaN  386,918   96,583      NaN
7        100            MARINO, REBECCA   NaN  CAN  455,476   25,081      NaN
8        101                JUVAN, KAJA   NaN  SLO  479,100      435      NaN
9        102           BAINDL, KATERYNA   NaN  UKR  464,741   13,929      NaN
10       103               KANEPI, KAIA   NaN  EST  462,316   13,374      NaN
11       104           BRENGLE, MADISON   NaN  USA  459,030   13,520      NaN
12       105             ROGERS, SHELBY   NaN  USA  435,590   26,507      NaN
13       106             NIEMEIER, JULE   NaN  GER  446,471   13,300      NaN
14       107             SHIBAHARA, ENA   NaN  JPN   26,155  385,903   38,554
15       108               RUS, ARANTXA   NaN  NED  391,495   46,435      NaN
16       109       RUSE, ELENA-GABRIELA   NaN  ROU  218,963  211,053      NaN
17       110          PETERSON, REBECCA   NaN  SWE  418,896    8,706      NaN
18       111          KORPATSCH, TAMARA   NaN  GER  411,177   13,688      NaN
19       112               PEREZ, ELLEN   NaN  AUS   52,585  337,020   33,100
20       113           ZANEVSKA, MARYNA   NaN  BEL  395,309   22,206      NaN
21       114             GRABHER, JULIA   NaN  AUT  407,156    9,331      NaN
22       115          BIRRELL, KIMBERLY   NaN  AUS  393,022    7,927    8,729
23       116              AOYAMA, SHUKO   NaN  JPN      NaN  407,342      NaN
24       117            CHAN, HAO-CHING   NaN  TPE    2,075  374,372   26,054
25       118         YASTREMSKA, DAYANA   NaN  UKR  393,457    5,624      NaN
26       119                 KATO, MIYU   NaN  JPN    7,420  264,347  126,000
27       120              DART, HARRIET   NaN  GBR  360,935   27,812      NaN
28       121            BRADY, JENNIFER   NaN  USA  286,937   99,525      NaN
29       122             BURRAGE, JODIE   NaN  GBR  366,412   15,897    4,000
30       123            GADECKI, OLIVIA   NaN  AUS  319,203   30,820   32,779
31       124        FRIEDSAM, ANNA-LENA   NaN  GER  348,481   33,698      NaN
32       125  MELICHAR-MARTINEZ, NICOLE   NaN  USA    6,860  357,144   13,554
33       126         GOLUBIC, VIKTORIJA   NaN  SUI  343,550   31,870      NaN
34       127            KRUEGER, ASHLYN   NaN  USA  338,585   29,218    7,100
35       128         MARTINCOVA, TEREZA   NaN  CZE  351,572   23,066      NaN
36       129         KICHENOK, LYUDMYLA   NaN  UKR      NaN  227,855  142,554
37       130              MCNALLY, CATY   NaN  USA  291,329   77,625      NaN
38       131             UDVARDY, PANNA   NaN  HUN  333,708   35,128      NaN
39       132             KOVINIC, DANKA   NaN  MNE  351,047   16,249      NaN
40       133          KRAWCZYK, DESIRAE   NaN  USA      NaN  320,635   41,779
41       134          WICKMAYER, YANINA   NaN  BEL  304,279   55,227      NaN
42       135        CRISTIAN, JAQUELINE   NaN  ROU  324,114   30,153      NaN
43       136              TAUSON, CLARA   NaN  DEN  353,423      NaN      NaN
44       137                 DAY, KAYLA   NaN  USA  349,704    1,580      NaN
45       138            OLMOS, GIULIANA   NaN  MEX    2,860  315,460   29,829

      Total
0   504,471
1   498,838
2   498,089
3   495,889
4   492,955
5   486,699
6   483,501
7   480,557
8   479,535
9   478,670
10  475,690
11  472,550
12  462,097
13  459,771
14  450,612
15  437,930
16  430,016
17  427,602
18  424,865
19  422,705
20  417,515
21  416,487
22  409,678
23  407,342
24  402,501
25  399,081
26  397,767
27  388,747
28  386,462
29  386,309
30  382,802
31  382,179
32  377,558
33  375,420
34  374,903
35  374,638
36  370,409
37  368,954
38  368,836
39  367,296
40  362,414
41  359,507
42  354,267
43  353,423
44  351,284
45  348,149

In [6]:
#print(wta_dfs[2].columns)

Index(['Standing', 'Unnamed: 0', 'Name', 'Nat', 'Singles', 'Doubles', 'Mixed',
       'Total'],
      dtype='object')

In [7]:
#print(wta_dfs[10])

    Standing                           Name  Nat Singles Doubles  Mixed  \
0        461               VISMANE, DANIELA  LAT  15,390   7,094    NaN
1        462                  LAHEY, ASHLEY  USA  15,427   6,975    NaN
2        463               STRUPLOVA, JULIE  CZE  19,780   2,554    NaN
3        464              COLMEGNA, MARTINA  ITA  19,059   3,159    NaN
4        465          VAN DER HOEK, ROSALIE  NED     152  22,033    NaN
5        466               COSTOULAS, SOFIA  BEL  17,249   4,685    NaN
6        467                 DINU, CRISTINA  ROU  17,219   4,706    NaN
7        468              BUYUKAKCAY, CAGLA  TUR  19,884   1,907    NaN
8        469                  DUERST, JENNY  SUI  14,306   7,192    NaN
9        470              KUZMOVA, KATARINA  SVK  17,959   3,407    NaN
10       471                HEWITT, DALAYNA  USA  12,951   8,375    NaN
11       472                 KUBKA, MARTYNA  POL  14,365   6,755    NaN
12       473            MARCINKEVICA, DIANA  LAT  14,049   6,886    NaN
13       474                       ITO, AOI  JPN  16,417   4,415    NaN
14       475         GARCIA PEREZ, GEORGINA  ESP  14,275   6,499    NaN
15       476               IATCENKO, POLINA  NaN  17,887   2,654    NaN
16       477                 JORGE, MATILDE  POR   8,511  11,784    NaN
17       478             BARTUNKOVA, NIKOLA  CZE  18,017   2,238    NaN
18       479                BHOSALE, RUTUJA  IND  14,470   5,639    NaN
19       480                   SMITH, ALANA  USA  16,204   3,873    NaN
20       481             WONG, HONG YI CODY  HKG  14,176   5,755    NaN
21       482                  HAAS, BARBARA  AUT  19,825     101    NaN
22       483                   ROGERS, ANNA  USA   6,508  13,286    NaN
23       484                   BACK, DAYEON  KOR  16,796   2,841    NaN
24       485               RYSER, VALENTINA  SUI  18,140   1,349    NaN
25       486                 OKAMURA, KYOKA  JPN  15,920   3,489    NaN
26       487                   CHANG, HANNA  USA  18,941     363    NaN
27       488                  GLUSHKO, LINA  ISR  14,665   4,603    NaN
28       489                  GAVRILA, OANA  ROU   9,405   9,765    NaN
29       490           SOBOLEVA, ANASTASIYA  UKR  17,858   1,240    NaN
30       491          CIRIC BAGARIC, LUCIJA  CRO  18,077   1,020    NaN
31       492              KOZAROV, KATARINA  SRB  16,842   2,215    NaN
32       493          DI LORENZO, FRANCESCA  USA  12,671   6,268    NaN
33       494              GABUEVA, ANGELINA  NaN   2,804  15,932    NaN
34       495               BOJICA, STEFANIA  ROU  16,629   2,042    NaN
35       496               STOSUR, SAMANTHA  AUS     NaN  14,082  4,554
36       497                  RADISIC, NIKA  SLO  10,026   8,567    NaN
37       498                  LEE, YA-HSUAN  TPE  15,699   2,826    NaN
38       499                MALYGINA, ELENA  EST  15,181   3,331    NaN
39       500            FOMINA-KLOTZ, ALENA  NaN   1,394  17,060    NaN
40       501                KURAMOCHI, MIHO  JPN  16,844   1,552    NaN
41       502             CHERUBINI, DILETTA  ITA  15,890   2,445    NaN
42       503               AMBROSIO, SILVIA  ITA  17,371     916    NaN
43       504  NAVARRO OLIVA, MARIA FERNANDA  MEX  12,798   5,449    NaN
44       505                 OSTLUND, FANNY  SWE  11,424   6,805    NaN
45       506             BERBEROVIC, NEFISA  BIH  15,913   2,286    NaN

     Total
0   22,485
1   22,402
2   22,334
3   22,218
4   22,186
5   21,934
6   21,926
7   21,792
8   21,498
9   21,367
10  21,326
11  21,120
12  20,935
13  20,832
14  20,775
15  20,542
16  20,295
17  20,255
18  20,109
19  20,077
20  19,931
21  19,926
22  19,794
23  19,637
24  19,489
25  19,410
26  19,304
27  19,268
28  19,171
29  19,098
30  19,097
31  19,057
32  18,939
33  18,736
34  18,671
35  18,636
36  18,594
37  18,526
38  18,512
39  18,455
40  18,396
41  18,335
42  18,287
43  18,248
44  18,229
45  18,200

In [9]:
#DO NOT USE, WILL ERROR: 
#wta_df.drop(columns=['Name'], inplace=True)

NameError: name 'wta_df' is not defined

In [ ]:
#Faulty original failed to specify that "name" was a column 
# if (len(wta_df.columns) == 7):
#     wta_df.drop('Name', inplace=True)
#     wta_df.rename(columns={'Unnamed: 0': 'Name'}, inplace=True)

In [10]:
#only keep the columns that are common to the two dfs
#wta_dfs = wta_dfs[['Name', , ]
women_df= pd.DataFrame([])

for wta_df in wta_dfs:
    if (len(wta_df.columns) == 8):
        wta_df.drop(columns=['Name'], inplace=True)
        wta_df.rename(columns={'Unnamed: 0': 'Name'}, inplace=True)
    wta_df.rename(columns={'Standing': 'Rank'}, inplace=True)   
    wta_df = wta_df[['Rank','Name', 'Total', 'Singles','Doubles' ]]
    women_df = pd.concat([women_df, wta_df])

In [11]:
print(women_df.columns)

Index(['Rank', 'Name', 'Total', 'Singles', 'Doubles'], dtype='object')

In [ ]:
#previously: didn't have the INPLACE parameter

In [12]:
women_df.reset_index(drop = True, inplace=True)

In [13]:
#Cutting off at index 499
women_df = women_df[women_df['Rank'] <= 500]

In [14]:
#len(women_df)

500

In [48]:
#women_df.to_csv("files/2023-10-09_wta.csv")

In [ ]:
#some columns have missing player names - pages == resolved thanks to RENAME

In [15]:
atp_dfs = tabula.read_pdf(atp_path, stream=True, user_agent="Mozilla/5.0", pages='1-12', pandas_options={'header': None})

In [16]:
#print(atp_dfs[0].columns)

RangeIndex(start=0, stop=6, step=1)

In [17]:
#print(atp_dfs[0])

     0                             1            2            3           4  \
0    1               Djokovic, Novak  $10,590,175  $10,581,665      $8,510
1    2               Alcaraz, Carlos   $9,603,879   $9,603,879          $0
2    3              Medvedev, Daniil   $7,833,244   $7,833,244          $0
3    4                Sinner, Jannik   $5,189,328   $5,138,315     $51,013
4    5                Rublev, Andrey   $4,731,576   $4,376,608    $354,968
5    6           Tsitsipas, Stefanos   $4,138,173   $4,004,628    $133,545
6    7             Zverev, Alexander   $3,645,582   $3,548,581     $97,001
7    8                 Fritz, Taylor   $3,370,858   $3,275,210     $95,648
8    9               Hurkacz, Hubert   $3,348,781   $3,250,532     $98,249
9   10                  Rune, Holger   $3,157,669   $3,135,158     $22,511
10  11                  Ruud, Casper   $3,042,290   $3,016,208     $26,082
11  12               de Minaur, Alex   $2,693,036   $2,611,602     $81,434
12  13               Tiafoe, Frances   $2,555,706   $2,479,170     $76,536
13  14              Khachanov, Karen   $2,493,112   $2,189,372    $303,740
14  15                   Paul, Tommy   $2,460,380   $2,400,937     $59,443
15  16              Dimitrov, Grigor   $2,189,436   $2,150,888     $38,548
16  17               Norrie, Cameron   $2,124,229   $2,037,402     $86,827
17  18                  Shelton, Ben   $2,121,570   $1,931,689    $189,881
18  19              Musetti, Lorenzo   $1,908,774   $1,863,395     $45,379
19  20          Cerundolo, Francisco   $1,843,941   $1,784,398     $59,543
20  21  Davidovich Fokina, Alejandro   $1,805,832   $1,766,779     $39,053
21  22                Jarry, Nicolas   $1,673,715   $1,639,389     $34,326
22  23                 Lehecka, Jiri   $1,621,192   $1,533,785     $87,407
23  24             Mannarino, Adrian   $1,594,422   $1,518,540     $75,882
24  25                 Evans, Daniel   $1,581,958   $1,491,941     $90,017
25  26              Korda, Sebastian   $1,525,530   $1,503,280     $22,250
26  27            Griekspoor, Tallon   $1,458,073   $1,333,379    $124,694
27  28             Bublik, Alexander   $1,425,108   $1,351,990     $73,118
28  29                  Coric, Borna   $1,423,273   $1,418,121      $5,152
29  30      Etcheverry, Tomas Martin   $1,411,239   $1,316,699     $94,540
30  31          Eubanks, Christopher   $1,405,068   $1,334,620     $70,448
31  32           McDonald, Mackenzie   $1,357,973   $1,173,844    $184,129
32  33           Struff, Jan-Lennard   $1,278,527   $1,240,777     $37,750
33  34               Baez, Sebastian   $1,260,463   $1,175,855     $84,608
34  35               Sonego, Lorenzo   $1,245,272   $1,205,538     $39,734
35  36                  Djere, Laslo   $1,232,303   $1,205,176     $27,127
36  37                  Humbert, Ugo   $1,215,829   $1,195,659     $20,170
37  38           Nishioka, Yoshihito   $1,203,742   $1,165,661     $38,081
38  39        Auger-Aliassime, Felix   $1,186,129   $1,107,948     $78,181
39  40                Wawrinka, Stan   $1,162,316   $1,120,067     $42,249
40  41      van de Zandschulp, Botic   $1,157,687     $958,082    $199,605
41  42              Krajicek, Austin   $1,097,698           $0  $1,097,698
42  43                 Kubler, Jason   $1,095,448     $745,575    $349,873
43  44              Safiullin, Roman   $1,092,256   $1,068,516     $23,740

               5
0   $175,281,484
1    $21,433,522
2    $34,433,626
3    $11,776,498
4    $19,715,035
5    $27,269,803
6    $36,550,638
7    $13,432,999
8    $12,179,259
9     $6,164,147
10   $16,095,527
11   $10,534,509
12    $9,807,882
13   $14,719,137
14    $6,170,351
15   $24,148,180
16   $10,074,701
17    $2,404,962
18    $4,618,939
19    $3,403,851
20    $5,328,047
21    $4,095,688
22    $2,573,526
23   $11,215,056
24    $7,866,215
25    $4,202,098
26    $3,020,676
27    $5,666,761
28   $11,536,029
29    $2,102,575
30    $2,570,757
31    $5,049,541
32    $8,984,557
33    $2,507,949
34    $5,563,570
35    $5,153,240
36    $4,578,541
37    $5,602,179
38   $11,389,726
39   $36,492,979
40    $3,647,540
41    $3,262,896
42    $2,348,792
43    $1,944,082

In [18]:
men_df= pd.DataFrame([])

for atp_df in atp_dfs:
    atp_df.columns = ['Rank', 'Name', 'Total', 'Singles','Doubles', 'Career']
    atp_df = atp_df[['Rank','Name', 'Total', 'Singles','Doubles' ]]
    men_df = pd.concat([men_df, atp_df])

In [19]:
men_df['Total'] = men_df['Total'].str.strip('$')

In [20]:
men_df['Singles'] = men_df['Singles'].str.strip('$')

In [21]:
men_df['Doubles'] = men_df['Doubles'].str.strip('$')

In [65]:
#NOT WORKING: men_df["Rank"] = men_df["Rank"].astype(int)

In [22]:
#print(men_df.columns)

Index(['Rank', 'Name', 'Total', 'Singles', 'Doubles'], dtype='object')

In [23]:
men_df.reset_index(drop = True, inplace=True)

In [ ]:
#WE JUST LOST DJOKOVIC!!!!  --> resolved with correct tabula formula

In [67]:
#NOT WORKING, either as int or as string 
#men_df = men_df[men_df['Rank'] <= 500]

In [24]:
#we used the index 
men_df = men_df[men_df.index <= 499]

In [25]:
#len(men_df)

500

In [19]:
#mkdir files 
#cd files 
#name each file with the date  
#also store all weekly rank data in a single file, for atp and wta ("all_weeks")

In [20]:
#already done:
#os.mkdir("files")

In [26]:
date = date.today()

In [27]:
print(date)

2023-10-22

In [28]:
women_df.to_csv(f"files/{date}_wta.csv")

In [ ]:
#PROBLEM: the index vaues repeat themselves instead of being sequential == resolved via "inplace=true
#LETS SEE AFTER WE COMBINE

In [29]:
men_df.to_csv(f"files/{date}_atp.csv")

In [30]:
men_df['gender'] = 'male'
women_df['gender'] = 'female'

In [31]:
mixed_df = pd.concat([women_df, men_df])

In [ ]:
#print(mixed_df)

In [32]:
#print(mixed_df.iloc[55])

Rank                  56
Name       PARKS, ALYCIA
Total            762,894
Singles          533,141
Doubles          222,653
gender            female
Name: 55, dtype: object

In [33]:
#print(mixed_df.iloc[552])

Rank                    53
Name       Koolhof, Wesley
Total              989,496
Singles                  0
Doubles            989,496
gender                male
Name: 52, dtype: object

In [ ]:
#problems with women_df from last session: 
# - ranks not in sequence: 
# - no names for some pages: 
# - doubles earnings missing last 3 digits:

In [34]:
#mixed_df.reset_index(inplace=True)
mixed_df.reset_index(drop = True, inplace=True)

In [ ]:
#******** RETURN TO THIS AFTER

In [35]:
#mixed_df.to_csv(f"files/{date}_mixed.csv")

In [81]:
#HOW/WHAT do we compare??
#compare [gender]=women at RANK i vs gender - men at rank i
#Do we keep the names or just the ranks? 
# what does DW show? 
#OPTION 1
#weekly updated table of the difference between W1 M1
#BUT if you hover over any of the rows, you get the info on absolute earnings and player name ()both are bound to change due to ranking change) 
#OPTION 2
#Show difference at each rank, plus respective names??? CTA -- hover to see actual earnings$$ 

#create a new df called "difference" loop thru mixed df by looping with gender-female from rank 1 to 500, 
# then gender-male at rank value 1 to 500,

In [ ]:
# for player in mixed_df:
#     if mixed_df[[gender = female && index ]]

In [ ]:
# diff = 0
# for woman in women_df: 
#     difference_df = pd.DataFrame()

In [82]:
# ranks = []
# diff = []

# for index in women_df.index:
#     men_total = men_df.iloc[index]['Total']
#     women_total = women_df.iloc[index]['Total']
#     ranks.append(index + 1)
#     diff.append(men_total - women_total)

TypeError: unsupported operand type(s) for -: 'str' and 'str'

In [ ]:
#remove commas

In [83]:
# men_total = int(men_df.iloc[index]['Total'].replace(',', ''))
# women_total = int(women_df.iloc[index]['Total'].replace(',', ''))

In [84]:
# ranks = []
# diff = []

# for index in women_df.index:
#     men_total = int(men_df.iloc[index]['Total'].replace(',', ''))
#     women_total = int(women_df.iloc[index]['Total'].replace(',', ''))
#     ranks.append(index + 1)
#     diff.append(men_total - women_total)

In [85]:
# len(diff)

500

In [86]:
# diff_df = pd.DataFrame([])
# diff_df['Rank'] = ranks
# diff_df['diff'] = diff

In [88]:
# diff_df.head()

   Rank     diff
0     1  3220540
1     2  3949552
2     3  2321788
3     4   396936
4     5  -190467

In [ ]:
#next: add names??

In [89]:
# diff_df = pd.DataFrame([])
# diff_df['Rank'] = ranks
# diff_df['diff'] = diff
# diff_df['women'] = women_df['Name']
# diff_df['men'] = men_df['Name']

In [90]:
# diff_df.head(50)

   Rank     diff                 women               men
0     1  3220540      SABALENKA, ARYNA   Djokovic, Novak
1     2  3949552           GAUFF, COCO   Alcaraz, Carlos
2     3  2321788          SWIATEK, IGA  Medvedev, Daniil
3     4   396936       RYBAKINA, ELENA    Sinner, Jannik
4     5  -190467  VONDROUSOVA, MARKETA    Rublev, Andrey

In [ ]:
#NEXT: percentage difference

In [36]:
#USE THE BELOW: 
ranks = []
diff = []
pct = []

for index in women_df.index:
    men_total = int(men_df.iloc[index]['Total'].replace(',', ''))
    women_total = int(women_df.iloc[index]['Total'].replace(',', ''))
    ranks.append(index + 1)
    diff.append(men_total - women_total)
    pct.append((women_total/men_total)*100)

In [37]:
diff_df = pd.DataFrame([])
diff_df['Rank'] = ranks
diff_df['diff'] = diff
diff_df['pct'] = pct
diff_df['women'] = women_df['Name']
diff_df['men'] = men_df['Name']

In [38]:
#diff_df.head(20)

    Rank     diff         pct                 women                   men
0      1  3035522   71.336432      SABALENKA, ARYNA       Djokovic, Novak
1      2  2824193   70.593205          SWIATEK, IGA       Alcaraz, Carlos
2      3  1856622   76.298172           GAUFF, COCO      Medvedev, Daniil
3      4    91891   98.229231       RYBAKINA, ELENA        Sinner, Jannik
4      5   410686   91.320313       PEGULA, JESSICA        Rublev, Andrey
5      6  -137105  103.313177  VONDROUSOVA, MARKETA   Tsitsipas, Stefanos
6      7   841144   76.927031     MUCHOVA, KAROLINA     Zverev, Alexander
7      8   572294   83.022305           JABEUR, ONS         Fritz, Taylor
8      9   860400   74.307069        KVITOVA, PETRA       Hurkacz, Hubert
9     10   750256   76.240195        SAKKARI, MARIA          Rune, Holger
10    11   685832   77.456718         KEYS, MADISON          Ruud, Casper
11    12   572500   78.741465   SAMSONOVA, LIUDMILA       de Minaur, Alex
12    13   457877   82.084129   KREJCIKOVA, BARBORA       Tiafoe, Frances
13    14   434595   82.568172  HADDAD MAIA, BEATRIZ      Khachanov, Karen
14    15   439520   82.136093     OSTAPENKO, JELENA           Paul, Tommy
15    16   396123   81.907532        LINETTE, MAGDA      Dimitrov, Grigor
16    17   373833   82.401474    AZARENKA, VICTORIA       Norrie, Cameron
17    18   392225   81.512512      GARCIA, CAROLINE          Shelton, Ben
18    19   192293   89.925837        MERTENS, ELISE      Musetti, Lorenzo
19    20   242013   86.875231       BENCIC, BELINDA  Cerundolo, Francisco

In [39]:
#diff_df.tail(30)

     Rank   diff        pct                   women                      men
470   471  19130  52.714060         HEWITT, DALAYNA            Furness, Evan
471   472  19064  52.558232          KUBKA, MARTYNA  Niklas-Salminen, Patrik
472   473  19054  52.351897     MARCINKEVICA, DIANA            Sabanov, Ivan
473   474  19157  52.094326                ITO, AOI           Sabanov, Matej
474   475  19005  52.224736  GARCIA PEREZ, GEORGINA            Mena, Facundo
475   476  19110  51.805710        IATCENKO, POLINA               Te, Rigele
476   477  19144  51.459215          JORGE, MATILDE      Harrison, Christian
477   478  19101  51.466104      BARTUNKOVA, NIKOLA         Bourgue, Mathias
478   479  19020  51.391551         BHOSALE, RUTUJA    Chandrasekar, Anirudh
479   480  18947  51.447827            SMITH, ALANA         Kingsley, Cannon
480   481  18865  51.373853      WONG, HONG YI CODY          Kuzuhara, Bruno
481   482  18798  51.456461           HAAS, BARBARA            Masur, Daniel
482   483  18762  51.338313            ROGERS, ANNA           Echargui, Moez
483   484  18738  51.171336            BACK, DAYEON                  Li, Zhe
484   485  18880  50.793609        RYSER, VALENTINA          Fonio, Giovanni
485   486  18924  50.633902          OKAMURA, KYOKA         Forti, Francesco
486   487  18885  50.548587            CHANG, HANNA          Poullain, Lucas
487   488  18771  50.653277           GLUSHKO, LINA            Gengel, Marek
488   489  18834  50.443363           GAVRILA, OANA          Jacquet, Kyrian
489   490  18687  50.543867    SOBOLEVA, ANASTASIYA             Luz, Orlando
490   491  18282  51.090184   CIRIC BAGARIC, LUCIJA    Pervolarakis, Michail
491   492  18302  51.010466       KOZAROV, KATARINA            Weber, Arthur
492   493  18354  50.784329   DI LORENZO, FRANCESCA             Kirkin, Ergi
493   494  18511  50.302038       GABUEVA, ANGELINA              Kumar, Omni
494   495  18407  50.356006        BOJICA, STEFANIA             Kadhe, Arjun
495   496  18321  50.426171        STOSUR, SAMANTHA               Rola, Blaz
496   497  18187  50.553275           RADISIC, NIKA          Moeller, Marvin
497   498  18094  50.589842           LEE, YA-HSUAN           Nishikori, Kei
498   499  18091  50.575089         MALYGINA, ELENA          Ejupovic, Elmar
499   500  18049  50.556103     FOMINA-KLOTZ, ALENA  Prashanth, Vijay Sundar

In [ ]:
#SAVE THIS DIFF dataframe! --> feed to DW

In [3]:
diff_df.to_csv(f"files/{date}_diff.csv")

In [ ]:
#ALSO SAVE TO UNDATED csv!!!

In [4]:
diff_df.to_csv("latest_diff.csv")

In [5]:
ls

OCT9.ipynb                files/                    pay_gap.ipynb
README.md                 old_atp_live_ranking.csv  tennisOCT3.ipynb
action.yml                old_tennispay.ipynb       tennisgpt.ipynb
atp_live_ranking.csv      old_tennisweekly.ipynb    weekly_race_to_top.csv

In [7]:
ls-la

total 6448
drwxr-xr-x  19 mfhan  staff      608 Oct 22 22:21 ./
drwxr-xr-x  10 mfhan  staff      320 Oct 15 19:37 ../
-rw-r--r--@  1 mfhan  staff    10244 Oct 22 22:20 .DS_Store
drwxr-xr-x  13 mfhan  staff      416 Oct 22 22:22 .git/
drwxr-xr-x   4 mfhan  staff      128 Oct 22 22:20 .github/
drwxr-xr-x  12 mfhan  staff      384 Oct 22 22:21 .ipynb_checkpoints/
-rw-r--r--   1 mfhan  staff    87443 Oct  9 19:05 OCT9.ipynb
-rw-r--r--   1 mfhan  staff       20 Oct 22 20:26 README.md
-rw-r--r--   1 mfhan  staff        0 Oct 22 22:21 action.yml
-rw-r--r--@  1 mfhan  staff       47 Sep 21 17:11 atp_live_ranking.csv
drwxr-xr-x  16 mfhan  staff      512 Oct 22 20:56 files/
-rw-r--r--   1 mfhan  staff    34428 Oct 22 20:04 latest_diff.csv
-rw-r--r--@  1 mfhan  staff       20 Sep 21 17:03 old_atp_live_ranking.csv
-rw-r--r--   1 mfhan  staff    11970 Oct  9 14:40 old_tennispay.ipynb
-rw-r--r--   1 mfhan  staff  1565449 Oct  3 16:06 old_tennisweekly.ipynb
-rw-r--r--   1 mfhan  staff    66950 Oct 22 22:18 pay_gap.ipynb
-rw-r--r--   1 mfhan  staff   813332 Oct  3 16:47 tennisOCT3.ipynb
-rw-r--r--   1 mfhan  staff   679723 Oct  1 18:17 tennisgpt.ipynb
-rw-r--r--   1 mfhan  staff     1244 Oct  3 16:35 weekly_race_to_top.csv